<?php
/**
 * 以下是规则文件的具体格式
 */
return [
    'name' => '这是一个测试的规则02', //规则名称
    'rules' => [ //规则数组
        'field1' => [ //字段1
            'name' => '这是一个字段名称', //字段的名称
            'value' => 'xxxx', //字段的阈值
            'logic' => '=' //达到此数值后处理的逻辑
            // 可以自己扩张需要的东西
        ],
        'field2' => [ //字段2
            'name' => '这是一个字段名称', //字段的名称
            'value' => 'xxxx', //字段的阈值
            'logic' => '=' //达到此数值后处理的逻辑
            // 可以自己扩张需要的东西
        ],
    ],
    'description' => '这是一个某某某活动，参与条件是某某某，奖励是某某某，等等等.............' //规则的具体描述
];